spec/cassettes/retrieve_order.yml

---
http_interactions:
- request:
    method: get
    uri: https://145227:13a980d4f851f3d9a1cfc792fb1f5e50@secure.payu.com/api/v2/orders/VQWQ6XMVKR140415GUEST000P01
    body:
      encoding: US-ASCII
      string: ''
    headers:
      accept:
      - ! '*/*'
      user-agent:
      - Ruby
      authorization:
      - Basic MTQ1MjI3OjEzYTk4MGQ0Zjg1MWYzZDlhMWNmYzc5MmZiMWY1ZTUw
      content-type:
      - application/json
  response:
    status:
      code: 200
      message: OK
    headers:
      server:
      - nginx
      date:
      - Tue, 15 Apr 2014 14:12:28 GMT
      content-type:
      - application/json
      transfer-encoding:
      - chunked
      connection:
      - close
      expires:
      - '-1'
    body:
      encoding: US-ASCII
      string: ! '{"orders":{"orders":[{"shippingMethod":null,"status":"COMPLETED","payMethod":{"currencyCode":null,"amount":null,"card":null,"extPayMethodId":null,"value":null,"type":"PBL"},"notifyUrl":"http://localhost/","customerIp":"127.0.0.1","extOrderId":"1342","totalAmount":100,"buyer":{"invoice":null,"phone":"123123123","delivery":null,"billing":null,"customerId":"guest","extCustomerId":null,"email":"dd@ddd.pl","firstName":"Jan","lastName":"Kowalski","nin":null,"language":"PL"},"description":"New
        order","currencyCode":"PLN","fee":null,"merchantPosId":"145227","orderCreateDate":1397553548700,"orderUrl":"http://localhost/","products":{"products":[{"categoryName":null,"subMerchantId":null,"categoryId":null,"discount":null,"unitPrice":100,"extraInfo":null,"weight":null,"version":null,"code":null,"quantity":1,"name":"Mouse","size":null}]},"validityTime":48000,"orderId":"VQWQ6XMVKR140415GUEST000P01"}]},"pageResponse":null,"status":{"code":null,"statusCode":"SUCCESS","severity":null,"statusDesc":"Request
        processing successful","codeLiteral":null,"location":null},"version":"2.0","redirectUri":null,"resId":null,"properties":{"properties":[{"name":"PAYMENT_ID","value":"416204376"}]}}'
    http_version: '1.1'
  recorded_at: Tue, 15 Apr 2014 14:12:28 GMT
recorded_with: VCR 2.6.0
